# ========================= Messages =========================

MAIN_MENU = """
Привет👋🏻 

Выбери нужное действие⤵️
"""

SELECT_COUNTRY = 'Выберите страну⤵️'
SELECT_COUNTRY_RENT = ('— Длительная аренда от 3 до 30 дней с возможностью продления\n'
                       '— Неограниченное количество для приема СМС по любым сервисам, доступным в боте\n'
                       '— Если на арендованный номер поступит звонок для подтверждения регистрации, бот укажет звонивший номер\n\n'
                       'Выберите страну⤵️')

SELECT_SERVICE = ('- Если номер принял SMS, услуга считается оказанной и не подлежит возврату\n'
                  '- Подходит для приема одного СМС от конкретного сервиса\n'
                  '- Срок аренды 15 минут\n'
                  '- Повторно воспользоваться номером невозможно\n\n'
                  'Выберите сервис⤵️')
SELECT_RENTAL_PERIOD = "Выберите срок аренды⤵️"
ENTER_COUNTRY = "Введите наименование страны на русском языке⤵️"
ENTER_SERVICE = "Введите название необходимого сервиса⤵️"

ENTER_COUNTRY_ERROR = "Страна не найдена. Проверьте правильность ввода"

ENTER_SERVICE_ERROR = (
    "<b>Данный сервис не найден.</b>\n\n"
    "Проверьте корректность ввода или выберите категорию Любой другой"
)


# Страны, которые не должны отображаться в клавиатурах выбора страны
EXCLUDED_COUNTRIES = {"Россия"}



SERVICE_INFO = """
<b>Ваш номер</b> <code>+{phone}</code> (Кликабельно)

<b>Страна:</b> {country}
<b>Сервис:</b> {service}

Ожидаем SMS...

<i>- Срок жизни номера 15 минут.
- Если СМС не поступит, деньги вернутся на баланс в боте</i>
"""

SERVICE_INFO_TELEGRAM = """
<b>Ваш номер</b> <code>+{phone}</code> (Кликабельно)

<b>Страна:</b> {country}
<b>Сервис:</b> {service}

Ожидаем SMS...

<i>- Срок жизни номера 15 минут.
- Если СМС не поступит, деньги вернутся на баланс в боте</i>
"""

NUMBER_INFO = """
<b>Ваш арендованный номер:</b> <code>+{phone}</code>

<b>Страна:</b> {country}

<i>- Прием первого СМС должен быть совершен в течение первых 20 минут, иначе номер будет отменен, а средства вернутся на баланс.
- После приема первого сообщения номер будет доступен на весь заказанный срок.</i>
"""

RENT_DETAILS = """
<b>Ваш арендованный номер:</b> <code>+{phone_number}</code>

<b>Страна:</b> {flag} {country}

<b>Срок аренды до:</b> {expiry_date} мск

<i>- Убедитесь, что номер используется в течение указанного срока.
- После истечения срока номер станет недоступен.</i>
"""


RENT_SUCCESS_MESSAGE = "✅ Номер успешно арендован на {days}"
NUMBER_RENTAL_CLOSED = "Срок аренды номера {number} истек"

SERVICE_CANCEL_MONEY_RETURNED = """
⛔️Номер отменен

💰Деньги вернулись на баланс.
"""

SERVICE_CANCEL = """
⛔️Номер отменен
"""

NOT_ENOUGH_BALANCE = """
<b>Недостаточно средств</b>

Для оплаты требуется <code>{cost}</code> руб.

Ваш баланс: <code>{balance}</code> руб.
"""

NOT_ENOUGH_BALANCE_ALERT = "Недостаточно средств"

RENT_EMAIL_DISCOUNT_PROMO = """
Специально для вас мы подготовили персональную скидку!
Выберите подходящий срок аренды для продления⤵️
"""

RENT_EMAIL_NO_DISCOUNT = """
Выберите подходящий срок аренды для продления⤵️
"""

MY_EMAIL = """
<b>Ваш почтовый ящик⤵️</b>
{email}

<i>Ожидаем письмо...</i>

⚠️ Срок жизни почтового ящика - <b>30 минут.</b>
"""

MY_RENT_EMAIL = """
<b>Ваш почтовый ящик⤵️</b>
{email}

<i>Ожидаем письмо...</i>

⚠️ Арендован до: <b>{expire_at}</b>
"""

CONFIRM_RENT_EMAIL = """
<b>Вы собираетесь арендовать почтовый ящик ⤵️</b>
{dialog_data[email]}

Срок: <b>{dialog_data[rent_text]}</b>
Стоимость: <b>{dialog_data[cost]}₽</b>
"""

CONFIRM_EXTEND_EMAIL = """
<b>Вы собираетесь продлить почтовый ящик:</b>
{email}

Срок: <b>{rent_text}</b>
Стоимость: <b>{cost}₽</b>
"""

RENT_EMAIL_SUCCESS = """
Почтовый ящик <b>{dialog_data[email]}</b> успешно арендован!
Срок: {dialog_data[rent_text]}
"""

EXTEND_EMAIL_SUCCESS = """
Вы успешно продлили почтовый ящик <b>{email}</b> на <b>{rent_text}</b>
"""

PAID_EMAIL_INFO = """
<b>Почтовый ящик:</b> {email}

Арендован до: <b>{expire_at}</b>
"""

CREATING_EMAIL = "<b>Создание почтового ящика...</b>"

PERSONAL_CABINET = """
<b>ID:</b> <code>{user_id}</code>

<b>Мой кошелек:</b> <code>{balance}₽</code>
<b>Мой партнерский счет:</b> <code>{ref_balance}₽</code>
"""

SELECT_DEPOSIT_PRICE = "Выберите сумму пополнения⤵️"
SELECT_DEPOSIT_METHOD = "Выберите способ пополнения⤵️"
SELECT_DEPOSIT_METHOD_ANYPAY = "Способы оплаты AnyPay⤵️"
ENTER_DEPOSIT_AMOUNT = "Введите сумму пополнения"
FOLLOW_THE_LINK_TO_PAY = "Перейдите по ссылке для оплаты:"
PAYMENT = "Оплата"

ERROR_PAYMENT_METHOD = 'Возникла ошибка, воспользуйтесь другим методом оплаты'

PAYMENT_INFO_MSG = """
<b>Оплата счета №{payment_id}</b>

<b>Сумма:</b> <code>{amount}₽</code>
<b>Способ оплаты:</b> <code>{method}</code>

<i>Для оплаты нажмите кнопку <b>"Оплатить"</b></i>
"""

PAYMENT_SUCCESS = """
<b>💰Баланс успешно пополнен на <code>{amount}₽</code></b>
"""

AFFILIATE_PROGRAM_TEXT = """
🤝<b>Партнёрская программа</b>

Приводи друзей и зарабатывай 10% с их пополнений, пожизненно!

⬇️<b>Твоя реферальная ссылка:</b>
└ {link}

🏅Статистика:
├ Лично приглашённых: <b>{ref_count}</b>
├ Количество оплат: <b>{payment_count}</b>
├ Повторные оплаты: <b>{repeat_payment_count}</b>
├ Всего заработано: <b>{ref_balance_total}₽</b>
└ Доступно к выводу: <b>{ref_balance}₽</b>
"""

AFFILIATE_PROGRAM_TEXT_SHORT = """
🤝<b>Партнёрская программа</b>

Приводи друзей и зарабатывай 10% с их пополнений, пожизненно!

⬇️<b>Твоя реферальная ссылка:</b>
└ {link}

🏅Статистика:
├ Лично приглашённых: <b>{ref_count}</b>
├ Количество оплат: <b>{payment_count}</b>
"""

SHARE_BOT_TEXT = """

Пользователь {mention} приглашает вас в сервис приема СМС и Email сообщений.
{link}"""

WITHDRAW_TEXT = """
Вы можете вывести средства в криптовалюте или на баланс бота для оплаты наших услуг.
"""
ENTER_WITHDRAW_AMOUNT = "Введите сумму вывода"
ENTER_WITHDRAW_CARD = "Отправьте реквизиты банковской карты"
MIN_CRYPT_AMOUNT = 350 # минимальная сумма вывода в криптовалюте

WITHDRAW_INFO = """
<b>Вывод средств</b>

<b>Сумма:</b> <code>{amount}₽</code>
<b>Реквизиты:</b> <code>{requisites}</code>

<i>Для подтверждения вывода нажмите кнопку <b>"Подтвердить"</b></i>
"""

ADMIN_STAT = """
<b>👥 Количество пользователей:</b> {users_count}
<b>За сегодня:</b> {users_count_today}

━━━━━━━━━━━━━━━━━━━━━━━━
<b>📩 Статистика Email:</b>
<b>Получено:</b> {received_email_count}
<b>За сегодня:</b> {received_email_count_today}
<b>Арендованных Email:</b> {rent_email_count}
<b>Сейчас арендовано Email:</b> {rent_email_active_count}
<b>За сегодня:</b> {rent_email_count_today}

━━━━━━━━━━━━━━━━━━━━━━━━
<b>📲 Статистика SMS:</b>
<b>Всего SMS запрошено:</b> {rented_sms_total}
<b>За месяц:</b> {rented_sms_month}
<b>За сегодня:</b> {rented_sms_today}

<b>Доставлено SMS:</b> {delivered_sms_total}
<b>За месяц:</b> {delivered_sms_month}
<b>За сегодня:</b> {delivered_sms_today}

━━━━━━━━━━━━━━━━━━━━━━━━
<b>📞Аренда номеров:</b>
<b>Всего арендовано номеров:</b> {rented_number_total}
<b>За месяц:</b> {rented_number_month}
<b>За сегодня:</b> {rented_number_today}
<b>Повторно:</b> {repeat_purchases_total}

━━━━━━━━━━━━━━━━━━━━━━━━
<b>💳 Пополнения:</b>
<b>Всего:</b> {payments_count}
<b>Повторные оплаты:</b> {payments_repeat_count}
<b>За сегодня:</b> {payments_count_today} (<b>{payments_amount_today} руб.</b>)
<b>За {month_name}:</b> {payments_count_month} (<b>{payments_amount_month} руб.</b>)
<b>За {last_month_name}:</b> {payments_count_last_month} (<b>{payments_amount_last_month} руб.</b>)

━━━━━━━━━━━━━━━━━━━━━━━━
<b>⭐️ Статистика STARS:</b>
<b>За сегодня:</b> {stars_count_today} (<b>{stars_amount_today:.0f} руб.</b>)
<b>За {month_name}:</b> {stars_month_count} (<b>{stars_month_amount:.0f} руб.</b>)
<b>За {last_month_name}:</b> {stars_last_month_count} (<b>{stars_last_month_amount:.0f} руб.</b>)
"""

AFFILIATE_STAT = """
<b>Партнерская статистика:</b>

<code>{stat}</code>
"""

LOW_BALANCE_ALERT = """
⚠️Заканчивается баланс!

Успей пополнить в течение 24 часов и получи на счёт +10% от суммы пополнения ⤵️
"""

NOT_NUMBERS_ALERT = "Для данного сервиса нет доступных номеров. Попробуйте позже"

NUMBER_REQUEST_SENT = "Запрос на получение номера отправлен, пожалуйста ожидайте..."

PLEASE_WAIT_SECONDS = "Пожалуйста, подождите 5 секунд перед повторным запросом."

# Для продолжения подпишитесь на наш канал
SUBSCRIBE_CHANNEL = """
Для продолжения подпишитесь на наш канал
"""

# ========================= Buttons =========================

# Default
CONFIRM_BTN = '✅Подтвердить'
DECLINE_BTN = '❌Отклонить'
CONTINUE_BTN = '🔁Продолжить'
BACK_BTN = '« Назад'

# Start menu
RECEIVE_SMS_BTN = '📲Принять SMS'
RENT_NUMBER = '📞Длительная аренда'
RECEIVE_EMAIL_BTN = '📩Принять Email'
PERSONAL_CABINET_BTN = '👤Личный кабинет'
AFFILIATE_PROGRAM_BTN = '💰Партнерская программа'

# Country menu
SEARCH_COUNTRY_BTN = '🔎Поиск страны'
ENTER_AGAIN_BTN = 'Ввести заново'

# Service menu
SEARCH_SERVICE_BTN = '🔎Поиск сервиса'
OTHER_SERVICE_BTN = 'Другой сервис'
CANCEL_SERVICE_BTN = '❌Отменить аренду номера'
REQUEST_ANOTHER_CODE = '➕Принять SMS для другого сервиса'
RECEIVE_ANOTHER_SMS_TO_NUMBER = '📩Принять новое SMS на этот же номер'

# Personal cabinet
DEPOSIT_BTN = '💵Пополнить баланс'
INSTRUCTIONS = "📖 Инструкция"
LINK_TO_BUTTON = "https://telegra.ph/Rekomendacii-dlya-priema-SMS-11-14"
SUPPORT_BTN = '🙋‍♂️Поддержка'

# Receive email
CHANGE_EMAIL_BTN = '🔄Сменить почтовый ящик'
RENT_EMAIL_BTN = '📬Арендовать почтовый ящик'
MY_RENT_EMAILS_BTN = '📨Мои ящики'
EXTEND_THE_LEASE = 'Продлить аренду'

GET_FULL_MESSAGE = "Получить полный текст сообщения"

# Константы для сообщений об аренде номера
RENT_NEW_ROOM = "📞Арендовать новый номер"
RENT_NOT_FOUND_MSG = "Аренда не найдена."
RENT_ALREADY_CANCELED_MSG = "Аренда уже отменена."
RENT_CANCEL_SUCCESS_MSG = "Аренда успешно отменена."
RENT_CANCEL_FAILED_MSG = "Аренда отменена"
ERROR_NO_OPERATIONS_MSG = "Ошибка: операция уже завершена или не найдена."
ERROR_OCCURED_MSG = "Произошла ошибка при отмене аренды. Попробуйте позже."
RENTAL_CANCELED_OR_NOT_FOUND = "Невозможно продлить аренду: аренда отменена или не найдена."
FAILED_TO_GET_AVAILABLE_DAYS = "Не удалось получить доступные дни для продления аренды."
NOT_ENOUGH_FUNDS_FOR_RENT = "Недостаточно средств для автопродления аренды\nПополните баланс по кнопке⤵"
RENT_WEEK_EXPIRING = """⏳ Срок бесплатной аренды недели заканчивается.
Хотите продлить аренду? Выберите подходящий тариф ниже."""

# Аренда электронной почты
RENT_EMAIL_WEEK_BTN = 'Неделя, 0₽'
RENT_EMAIL_MONTH_BTN = 'Месяц, 199₽'
RENT_EMAIL_SIX_MONTHS_BTN = '6 месяцев, 599₽'
RENT_EMAIL_YEAR_BTN = 'Год, 999₽'

# Константы для данных аренды
RENT_EMAIL_WEEK = (0, 7, '1 неделя')
RENT_EMAIL_MONTH = (199, 30, '1 месяц')
RENT_EMAIL_SIX_MONTHS = (599, 183, '6 месяцев')
RENT_EMAIL_YEAR = (999, 365, '1 год')

# Аренда электронной почты со скидкой
RENT_EMAIL_WEEK_BTN_DISCOUNT = 'Неделя 0₽'
RENT_EMAIL_MONTH_BTN_DISCOUNT = 'Месяц 199₽ > 169₽ (-15%)'
RENT_EMAIL_SIX_MONTHS_BTN_DISCOUNT = '6 месяцев 599₽ > 459₽ (-23%)'
RENT_EMAIL_YEAR_BTN_DISCOUNT = 'Год 999₽ > 749₽ (-25%)'

# Константы для данных аренды с учетом скидок
RENT_EMAIL_WEEK_DISCOUNT = (0, 7, '1 неделя с учетом скидки')
RENT_EMAIL_MONTH_DISCOUNT = (169, 30, '1 месяц с учетом скидки')
RENT_EMAIL_SIX_MONTHS_DISCOUNT = (459, 183, '6 месяцев с учетом скидки')
RENT_EMAIL_YEAR_DISCOUNT = (749, 365, '1 год с учетом скидки')

# Словари аренды
RENT_DATA = {
    'rent_email_week': RENT_EMAIL_WEEK,
    'rent_email_month': RENT_EMAIL_MONTH,
    'rent_email_six_months': RENT_EMAIL_SIX_MONTHS,
    'rent_email_year': RENT_EMAIL_YEAR,
}

RENT_DATA_DISCOUNT = {
    'rent_email_week_discount': RENT_EMAIL_WEEK_DISCOUNT,
    'rent_email_month_discount': RENT_EMAIL_MONTH_DISCOUNT,
    'rent_email_six_months_discount': RENT_EMAIL_SIX_MONTHS_DISCOUNT,
    'rent_email_year_discount': RENT_EMAIL_YEAR_DISCOUNT,
}

# Personal cabinet
OTHER_DEPOSIT_PRICE_BTN = 'Другая сумма'

METHOD_STREAMPAY = 'Оплата переводом (от 300 руб)'
METHOD_CKASSA = 'Банковская карта'
METHOD_YOOMONEY = 'Юmoney'
METHOD_LAVA = 'СБП (от 2000 руб)'
METHOD_ANYPAY = 'Оплата переводом (от 1000 руб)'
METHOD_STARS_BTN = 'Telegram Stars'
METHOD_CRYPTO_BTN = 'Криптовалюта'
METHOD_OTHER_BTN = 'Другие способы'

METHOD_BANK_CARD = 'Банковская карта'
METHOD_BANK_SBP = 'СБП'
METHOD_BANK_CRYPTOCURRENCY = 'Криптовалюта'

PAY_BTN = 'Оплатить'

# Affiliate program
SHARE_LINK_BTN = 'Поделиться ссылкой'
WITHDRAW_BTN = 'Вывод средств'

ON_BANK_CARD_BTN = 'На банковскую карту'
ON_CRYPTOCURRENCY_BTN = 'Криптовалюта'
ON_BALANCE_BTN = 'На баланс бота'

# My emails
RECEIVE_MY_EMAIL_BTN = '✉️Принять Email'
EXTEND_EMAIL_BTN = '📬Продлить аренду'

# Subscribe channel
SUBSCRIBE_CHANNEL_BTN = '↗️Перейти и подписаться'
READY_SUBSCRIBE_CHANNEL_BTN = '✅Я подписался'

# ========================= Data =========================
prices_data = [
    {'id': 1, 'price': 300},
    {'id': 2, 'price': 500},
    {'id': 3, 'price': 1000},
    {'id': 4, 'price': 5000}
]

CHANNEL_LINK = 'https://t.me/neuronbo'

# процент, который накидывает сервис
INTEREST = 1.5

DOLLAR_ONLINESIM = 78 * 1.5

DOLLAR_SMS_ACTIVATE = 100 * 1.5

# Словарь для перевода сокращений из названия сервисов в таблице services в названия сервисов таблицы onlinesim
SERVICES_TRANSLATION = {
    "tg": "telegram",
    "vk": "vkcom",
}

SERVICE_ONLINESIM = ['LinkedIn', 'Uber', 'Twitter|X', 'GroupMe', 'WeChat', 'Coinbase', 'Bumble', 'Instagram',
                     'Facebook', 'Airbnb', 'Bitstamp', 'Huobi Global', 'Binance', 'Google (Youtube, Gmail)',
                     'LINE', 'ICQ', 'HQ Trivia', 'Discord', 'TanTan', 'Jiayuan', 'WhatsApp', 'Tinder', 'ДругВокруг',
                     'Telegram', 'Дром', 'lino_network', 'Viber', 'Apple', 'MeetMe', 'Yalla', 'Одноклассники',
                     'Crypto.com', 'ChatGPT | OpenAI', 'ВКонтакте + Mail.ru', 'Рамблер', 'Yahoo', 'Amazon', 'Яндекс',
                     'AOL', 'QQ', 'Hinge', 'NAVER', 'Kucoin', 'KakaoTalk', 'Microsoft', 'Мамба', 'Bolt', 'LiveScore',
                     'eBay|Kleinanzeigen.', 'Seosprint', 'taxiMaxim', 'Steam', 'Gett', 'Gemini.com', 'Юла', 'OLX',
                     'ftx.com', 'Happn']

# SMSActivate
SMS_ACTIVATE_SERVICE_CODES_AT_ONLINESIM = ["ot"] # "ot" - Любой другой  "ts" - PayPal


# возвращает первый ключ, соответствующий значению
REVERSE_SERVICES_TRANSLATION = {v: k for k, v in SERVICES_TRANSLATION.items()}
key = REVERSE_SERVICES_TRANSLATION.get("telegram")


country_flags = {
    "Россия": "\U0001F1F7\U0001F1FA",  # 🇷🇺
    "Украина": "\U0001F1FA\U0001F1E6",  # 🇺🇦
    "Казахстан": "\U0001F1F0\U0001F1FF",  # 🇰🇿
    "Китай": "\U0001F1E8\U0001F1F3",  # 🇨🇳
    "Филиппины": "\U0001F1F5\U0001F1ED",  # 🇵🇭
    "Мьянма": "\U0001F1F2\U0001F1F2",  # 🇲🇲
    "Индонезия": "\U0001F1EE\U0001F1E9",  # 🇮🇩
    "Малайзия": "\U0001F1F2\U0001F1FE",  # 🇲🇾
    "Кения": "\U0001F1F0\U0001F1EA",  # 🇰🇪
    "Танзания": "\U0001F1F9\U0001F1FF",  # 🇹🇿
    "Вьетнам": "\U0001F1FB\U0001F1F3",  # 🇻🇳
    "Кыргызстан": "\U0001F1F0\U0001F1EC",  # 🇰🇬
    "США (виртуальные)": "\U0001F1FA\U0001F1F8",  # 🇺🇸
    "Израиль": "\U0001F1EE\U0001F1F1",  # 🇮🇱
    "Гонконг": "\U0001F1ED\U0001F1F0",  # 🇭🇰
    "Польша": "\U0001F1F5\U0001F1F1",  # 🇵🇱
    "Англия": "\U0001F1EC\U0001F1E7",  # 🇬🇧
    "Мадагаскар": "\U0001F1F2\U0001F1EC",  # 🇲🇬
    "Дем. Конго": "\U0001F1E8\U0001F1E9",  # 🇨🇩
    "Нигерия": "\U0001F1F3\U0001F1EC",  # 🇳🇬
    "Макао": "\U0001F1F2\U0001F1F4",  # 🇲🇴
    "Египет": "\U0001F1EA\U0001F1EC",  # 🇪🇬
    "Индия": "\U0001F1EE\U0001F1F3",  # 🇮🇳
    "Ирландия": "\U0001F1EE\U0001F1EA",  # 🇮🇪
    "Камбоджа": "\U0001F1F0\U0001F1ED",  # 🇰🇭
    "Лаос": "\U0001F1F1\U0001F1E6",  # 🇱🇦
    "Гаити": "\U0001F1ED\U0001F1F9",  # 🇭🇹
    "Кот д'Ивуар": "\U0001F1E8\U0001F1EE",  # 🇨🇮
    "Гамбия": "\U0001F1EC\U0001F1F2",  # 🇬🇲
    "Сербия": "\U0001F1F7\U0001F1F8",  # 🇷🇸
    "Йемен": "\U0001F1FE\U0001F1EA",  # 🇾🇪
    "ЮАР": "\U0001F1FF\U0001F1E6",  # 🇿🇦
    "Румыния": "\U0001F1F7\U0001F1F4",  # 🇷🇴
    "Колумбия": "\U0001F1E8\U0001F1F4",  # 🇨🇴
    "Эстония": "\U0001F1EA\U0001F1EA",  # 🇪🇪
    "Азербайджан": "\U0001F1E6\U0001F1FF",  # 🇦🇿
    "Канада": "\U0001F1E8\U0001F1E6",  # 🇨🇦
    "Марокко": "\U0001F1F2\U0001F1E6",  # 🇲🇦
    "Гана": "\U0001F1EC\U0001F1ED",  # 🇬🇭
    "Аргентина": "\U0001F1E6\U0001F1F7",  # 🇦🇷
    "Узбекистан": "\U0001F1FA\U0001F1FF",  # 🇺🇿
    "Камерун": "\U0001F1E8\U0001F1F2",  # 🇨🇲
    "Чад": "\U0001F1F9\U0001F1E9",  # 🇹🇩
    "Германия": "\U0001F1E9\U0001F1EA",  # 🇩🇪
    "Литва": "\U0001F1F1\U0001F1F9",  # 🇱🇹
    "Хорватия": "\U0001F1ED\U0001F1F7",  # 🇭🇷
    "Швеция": "\U0001F1F8\U0001F1EA",  # 🇸🇪
    "Ирак": "\U0001F1EE\U0001F1F6",  # 🇮🇶
    "Нидерланды": "\U0001F1F3\U0001F1F1",  # 🇳🇱
    "Латвия": "\U0001F1F1\U0001F1FB",  # 🇱🇻
    "Австрия": "\U0001F1E6\U0001F1F9",  # 🇦🇹
    "Беларусь": "\U0001F1E7\U0001F1FE",  # 🇧🇾
    "Таиланд": "\U0001F1F9\U0001F1ED",  # 🇹🇭
    "Сауд. Аравия": "\U0001F1F8\U0001F1E6",  # 🇸🇦
    "Мексика": "\U0001F1F2\U0001F1FD",  # 🇲🇽
    "Тайвань": "\U0001F1F9\U0001F1FC",  # 🇹🇼
    "Испания": "\U0001F1EA\U0001F1F8",  # 🇪🇸
    "Иран": "\U0001F1EE\U0001F1F7",  # 🇮🇷
    "Алжир": "\U0001F1E9\U0001F1FF",  # 🇩🇿
    "Словения": "\U0001F1F8\U0001F1EE",  # 🇸🇮
    "Бангладеш": "\U0001F1E7\U0001F1E9",  # 🇧🇩
    "Сенегал": "\U0001F1F8\U0001F1F3",  # 🇸🇳
    "Турция": "\U0001F1F9\U0001F1F7",  # 🇹🇷
    "Чехия": "\U0001F1E8\U0001F1FF",  # 🇨🇿
    "Шри-Ланка": "\U0001F1F1\U0001F1F0",  # 🇱🇰
    "Перу": "\U0001F1F5\U0001F1EA",  # 🇵🇪
    "Пакистан": "\U0001F1F5\U0001F1F0",  # 🇵🇰
    "Новая Зеландия": "\U0001F1F3\U0001F1FF",  # 🇳🇿
    "Гвинея": "\U0001F1EC\U0001F1F3",  # 🇬🇳
    "Мали": "\U0001F1F2\U0001F1F1",  # 🇲🇱
    "Венесуэла": "\U0001F1FB\U0001F1EA",  # 🇻🇪
    "Эфиопия": "\U0001F1EA\U0001F1F9",  # 🇪🇹
    "Монголия": "\U0001F1F2\U0001F1F3",  # 🇲🇳
    "Бразилия": "\U0001F1E7\U0001F1F7",  # 🇧🇷
    "Афганистан": "\U0001F1E6\U0001F1EB",  # 🇦🇫
    "Уганда": "\U0001F1FA\U0001F1EC",  # 🇺🇬
    "Ангола": "\U0001F1E6\U0001F1F4",  # 🇦🇴
    "Кипр": "\U0001F1E8\U0001F1FE",  # 🇨🇾
    "Франция": "\U0001F1EB\U0001F1F7",  # 🇫🇷
    "Папуа-Новая Гвинея": "\U0001F1F5\U0001F1EC",  # 🇵🇬
    "Мозамбик": "\U0001F1F2\U0001F1FF",  # 🇲🇿
    "Непал": "\U0001F1F3\U0001F1F5",  # 🇳🇵
    "Бельгия": "\U0001F1E7\U0001F1EA",  # 🇧🇪
    "Болгария": "\U0001F1E7\U0001F1EC",  # 🇧🇬
    "Венгрия": "\U0001F1ED\U0001F1FA",  # 🇭🇺
    "Молдова": "\U0001F1F2\U0001F1E9",  # 🇲🇩
    "Италия": "\U0001F1EE\U0001F1F9",  # 🇮🇹
    "Парагвай": "\U0001F1F5\U0001F1FE",  # 🇵🇾
    "Гондурас": "\U0001F1ED\U0001F1F3",  # 🇭🇳
    "Тунис": "\U0001F1F9\U0001F1F3",  # 🇹🇳
    "Никарагуа": "\U0001F1F3\U0001F1EE",  # 🇳🇮
    "Тимор-Лесте": "\U0001F1F9\U0001F1F1",  # 🇹🇱
    "Боливия": "\U0001F1E7\U0001F1F4",  # 🇧🇴
    "Коста Рика": "\U0001F1E8\U0001F1F7",  # 🇨🇷
    "Гватемала": "\U0001F1EC\U0001F1F9",  # 🇬🇹
    "ОАЭ": "\U0001F1E6\U0001F1EA",  # 🇦🇪
    "Зимбабве": "\U0001F1FF\U0001F1FC",  # 🇿🇼
    "Пуэрто-Рико": "\U0001F1F5\U0001F1F7",  # 🇵🇷
    "Судан": "\U0001F1F8\U0001F1E9",  # 🇸🇩
    "Того": "\U0001F1F9\U0001F1EC",  # 🇹🇬
    "Кувейт": "\U0001F1F0\U0001F1FC",  # 🇰🇼
    "Сальвадор": "\U0001F1F8\U0001F1FB",  # 🇸🇻
    "Ливия": "\U0001F1F1\U0001F1FE",  # 🇱🇾
    "Ямайка": "\U0001F1EF\U0001F1F2",  # 🇯🇲
    "Тринидад и Тобаго": "\U0001F1F9\U0001F1F9",  # 🇹🇹
    "Эквадор": "\U0001F1EA\U0001F1E8",  # 🇪🇨
    "Свазиленд": "\U0001F1F8\U0001F1FF",  # 🇸🇿
    "Оман": "\U0001F1F4\U0001F1F2",  # 🇴🇲
    "Босния и Герцеговина": "\U0001F1E7\U0001F1E6",  # 🇧🇦
    "Доминиканская Республика": "\U0001F1E9\U0001F1F4",  # 🇩🇴
    "Сирия": "\U0001F1F8\U0001F1FE",  # 🇸🇾
    "Катар": "\U0001F1F6\U0001F1E6",  # 🇶🇦
    "Панама": "\U0001F1F5\U0001F1E6",  # 🇵🇦
    "Куба": "\U0001F1E8\U0001F1FA",  # 🇨🇺
    "Мавритания": "\U0001F1F2\U0001F1F7",  # 🇲🇷
    "Сьерра-Леоне": "\U0001F1F8\U0001F1F1",  # 🇸🇱
    "Иордания": "\U0001F1EF\U0001F1F4",  # 🇯🇴
    "Португалия": "\U0001F1F5\U0001F1F9",  # 🇵🇹
    "Барбадос": "\U0001F1E7\U0001F1E7",  # 🇧🇧
    "Бурунди": "\U0001F1E7\U0001F1EE",  # 🇧🇮
    "Бенин": "\U0001F1E7\U0001F1EF",  # 🇧🇯
    "Бруней": "\U0001F1E7\U0001F1F3",  # 🇧🇳
    "Багамы": "\U0001F1E7\U0001F1F8",  # 🇧🇸
    "Ботсвана": "\U0001F1E7\U0001F1FC",  # 🇧🇼
    "Белиз": "\U0001F1E7\U0001F1FF",  # 🇧🇿
    "ЦАР": "\U0001F1E8\U0001F1EB",  # 🇨🇫
    "Доминика": "\U0001F1E9\U0001F1F2",  # 🇩🇲
    "Гренада": "\U0001F1EC\U0001F1E9",  # 🇬🇩
    "Грузия": "\U0001F1EC\U0001F1EA",  # 🇬🇪
    "Греция": "\U0001F1EC\U0001F1F7",  # 🇬🇷
    "Гвинея-Бисау": "\U0001F1EC\U0001F1FC",  # 🇬🇼
    "Гайана": "\U0001F1EC\U0001F1FE",  # 🇬🇾
    "Исландия": "\U0001F1EE\U0001F1F8",  # 🇮🇸
    "Коморы": "\U0001F1F0\U0001F1F2",  # 🇰🇲
    "Сент-Китс и Невис": "\U0001F1F0\U0001F1F3",  # 🇰🇳
    "Либерия": "\U0001F1F1\U0001F1F7",  # 🇱🇷
    "Лесото": "\U0001F1F1\U0001F1F8",  # 🇱🇸
    "Малави": "\U0001F1F2\U0001F1FC",  # 🇲🇼
    "Намибия": "\U0001F1F3\U0001F1E6",  # 🇳🇦
    "Нигер": "\U0001F1F3\U0001F1EA",  # 🇳🇪
    "Руанда": "\U0001F1F7\U0001F1FC",  # 🇷🇼
    "Словакия": "\U0001F1F8\U0001F1F0",  # 🇸🇰
    "Суринам": "\U0001F1F8\U0001F1F7",  # 🇸🇷
    "Таджикистан": "\U0001F1F9\U0001F1EF",  # 🇹🇯
    "Монако": "\U0001F1F2\U0001F1E8",  # 🇲🇨
    "Бахрейн": "\U0001F1E7\U0001F1ED",  # 🇧🇭
    "Реюньон": "\U0001F1F7\U0001F1EA",  # 🇷🇪
    "Замбия": "\U0001F1FF\U0001F1F2",  # 🇿🇲
    "Армения": "\U0001F1E6\U0001F1F2",  # 🇦🇲
    "Сомали": "\U0001F1F8\U0001F1F4",  # 🇸🇴
    "Конго": "\U0001F1E8\U0001F1EC",  # 🇨🇬
    "Чили": "\U0001F1E8\U0001F1F1",  # 🇨🇱
    "Буркина-Фасо": "\U0001F1E7\U0001F1EB",  # 🇧🇫
    "Ливан": "\U0001F1F1\U0001F1E7",  # 🇱🇧
    "Габон": "\U0001F1EC\U0001F1E6",  # 🇬🇦
    "Албания": "\U0001F1E6\U0001F1F1",  # 🇦🇱
    "Уругвай": "\U0001F1FA\U0001F1FE",  # 🇺🇾
    "Маврикий": "\U0001F1F2\U0001F1FA",  # 🇲🇺
    "Бутан": "\U0001F1E7\U0001F1F9",  # 🇧🇹
    "Мальдивы": "\U0001F1F2\U0001F1FB",  # 🇲🇻
    "Гваделупа": "\U0001F1EC\U0001F1F5",  # 🇬🇵
    "Туркменистан": "\U0001F1F9\U0001F1F2",  # 🇹🇲
    "Французская Гвиана": "\U0001F1EC\U0001F1EB",  # 🇬🇫
    "Финляндия": "\U0001F1EB\U0001F1EE",  # 🇫🇮
    "Сент-Люсия": "\U0001F1F1\U0001F1E8",  # 🇱🇨
    "Люксембург": "\U0001F1F1\U0001F1FA",  # 🇱🇺
    "Сент-Винсент и Гренадины": "\U0001F1FB\U0001F1E8",  # 🇻🇨
    "Экваториальная Гвинея": "\U0001F1EC\U0001F1F6",  # 🇬🇶
    "Джибути": "\U0001F1E9\U0001F1EF",  # 🇩🇯
    "Антигуа и Барбуда": "\U0001F1E6\U0001F1EC",  # 🇦🇬
    "Острова Кайман": "\U0001F1F0\U0001F1FE",  # 🇰🇾
    "Черногория": "\U0001F1F2\U0001F1EA",  # 🇲🇪
    "Дания": "\U0001F1E9\U0001F1F0",  # 🇩🇰
    "Швейцария": "\U0001F1E8\U0001F1ED",  # 🇨🇭
    "Норвегия": "\U0001F1F3\U0001F1F4",  # 🇳🇴
    "Австралия": "\U0001F1E6\U0001F1FA",  # 🇦🇺
    "Эритрея": "\U0001F1EA\U0001F1F7",  # 🇪🇷
    "Южный Судан": "\U0001F1F8\U0001F1F8",  # 🇸🇸
    "Сан-Томе и Принсипи": "\U0001F1F8\U0001F1F9",  # 🇸🇹
    "Аруба": "\U0001F1E6\U0001F1FC",  # 🇦🇼
    "Монтсеррат": "\U0001F1F2\U0001F1F8",  # 🇲🇸
    "Ангилья": "\U0001F1E6\U0001F1EE",  # 🇦🇮
    "Япония": "\U0001F1EF\U0001F1F5",  # 🇯🇵
    "Северная Македония": "\U0001F1F2\U0001F1F0",  # 🇲🇰
    "Республика Сейшелы": "\U0001F1F8\U0001F1E8",  # 🇸🇨
    "Новая Каледония": "\U0001F1F3\U0001F1E8",  # 🇳🇨
    "Кабо-Верде": "\U0001F1E8\U0001F1FB",  # 🇨🇻
    "США": "\U0001F1FA\U0001F1F8",  # 🇺🇸
    "Палестина": "\U0001F1F5\U0001F1F8",  # 🇵🇸
    "Фиджи": "\U0001F1EB\U0001F1EF",  # 🇫🇯
    "Южная Корея": "\U0001F1F0\U0001F1F7",  # 🇰🇷
    "Северная Корея": "\U0001F1F0\U0001F1F5",  # 🇰🇵
    "Западная Сахара": "\U0001F1EA\U0001F1ED",  # 🇪🇭
    "Соломоновы острова": "\U0001F1F8\U0001F1E7",  # 🇸🇧
    "Джерси": "\U0001F1EF\U0001F1EA",  # 🇯🇪
    "Бермуды": "\U0001F1E7\U0001F1F2",  # 🇧🇲
    "Сингапур": "\U0001F1F8\U0001F1EC",  # 🇸🇬
    "Тонга": "\U0001F1F9\U0001F1F4",  # 🇹🇴
    "Самоа": "\U0001F1FC\U0001F1F8",  # 🇼🇸
    "Мальта": "\U0001F1F2\U0001F1F9",  # 🇲🇹
    "Лихтенштейн": "\U0001F1F1\U0001F1EE",  # 🇱🇮
    "Гибралтар": "\U0001F1EC\U0001F1EE",  # 🇬🇮
    "Фарерские острова": "\U0001F1EB\U0001F1F4",  # 🇫🇴
    "Косово": "\U0001F1FD\U0001F1F0"  # 🇽🇰
}

sort_countries = {
    # первыми
    33: "Колумбия",
    151: "Чили",
    43: "Германия",
    0: "Россия",
    187: "США",
    16: "Англия",
    73: "Бразилия",
    7: "Малайзия",
    6: "Индонезия",
    4: "Филиппины",

    # Европейские страны
    1: "Украина",
    15: "Польша",
    23: "Ирландия",
    29: "Сербия",
    32: "Румыния",
    34: "Эстония",
    44: "Литва",
    45: "Хорватия",
    46: "Швеция",
    48: "Нидерланды",
    49: "Латвия",
    50: "Австрия",
    51: "Беларусь",
    56: "Испания",
    59: "Словения",
    63: "Чехия",
    77: "Кипр",
    78: "Франция",
    82: "Бельгия",
    83: "Болгария",
    84: "Венгрия",
    85: "Молдова",
    86: "Италия",
    108: "Босния и Герцеговина",
    117: "Португалия",
    129: "Греция",
    132: "Исландия",
    141: "Словакия",
    144: "Монако",
    163: "Финляндия",
    165: "Люксембург",
    171: "Черногория",
    172: "Дания",
    173: "Швейцария",
    174: "Норвегия",
    183: "Северная Македония",
    199: "Мальта",
    200: "Лихтенштейн",
    203: "Косово",

    # Остальные страны (сортировка по популярности/значимости)
    2: "Казахстан",
    3: "Китай",
    182: "Япония",
    22: "Индия",
    36: "Канада",
    175: "Австралия",
    190: "Южная Корея",
    196: "Сингапур",
    13: "Израиль",
    62: "Турция",
    35: "Азербайджан",
    40: "Узбекистан",
    11: "Кыргызстан",
    143: "Таджикистан",
    161: "Туркменистан",
    148: "Армения",
    128: "Грузия",
    57: "Иран",
    47: "Ирак",
    110: "Сирия",
    188: "Палестина",
    53: "Сауд. Аравия",
    95: "ОАЭ",
    100: "Кувейт",
    111: "Катар",
    145: "Бахрейн",
    107: "Оман",
    30: "Йемен",
    153: "Ливан",
    116: "Иордания",
    5: "Мьянма",
    10: "Вьетнам",
    14: "Гонконг",
    20: "Макао",
    24: "Камбоджа",
    25: "Лаос",
    52: "Таиланд",
    55: "Тайвань",
    60: "Бангладеш",
    64: "Шри-Ланка",
    66: "Пакистан",
    72: "Монголия",
    74: "Афганистан",
    81: "Непал",
    121: "Бруней",
    158: "Бутан",
    159: "Мальдивы",
    191: "Северная Корея",

    # Америка
    12: "США (виртуальные)",
    26: "Гаити",
    39: "Аргентина",
    54: "Мексика",
    65: "Перу",
    70: "Венесуэла",
    87: "Парагвай",
    88: "Гондурас",
    90: "Никарагуа",
    92: "Боливия",
    93: "Коста Рика",
    94: "Гватемала",
    97: "Пуэрто-Рико",
    101: "Сальвадор",
    103: "Ямайка",
    104: "Тринидад и Тобаго",
    105: "Эквадор",
    109: "Доминиканская Республика",
    112: "Панама",
    113: "Куба",
    118: "Барбадос",
    122: "Багамы",
    124: "Белиз",
    126: "Доминика",
    127: "Гренада",
    131: "Гайана",
    134: "Сент-Китс и Невис",
    142: "Суринам",
    156: "Уругвай",
    160: "Гваделупа",
    162: "Французская Гвиана",
    164: "Сент-Люсия",
    166: "Сент-Винсент и Гренадин",
    169: "Антигуа и Барбуда",
    170: "Острова Кайман",
    179: "Аруба",
    180: "Монтсеррат",
    181: "Ангилья",

    # Африканские страны
    8: "Кения",
    9: "Танзания",
    17: "Мадагаскар",
    18: "Дем. Конго",
    19: "Нигерия",
    21: "Египет",
    27: "Кот д'Ивуар",
    28: "Гамбия",
    31: "ЮАР",
    37: "Марокко",
    38: "Гана",
    41: "Камерун",
    42: "Чад",
    58: "Алжир",
    61: "Сенегал",
    68: "Гвинея",
    69: "Мали",
    71: "Эфиопия",
    75: "Уганда",
    76: "Ангола",
    80: "Мозамбик",
    89: "Тунис",
    96: "Зимбабве",
    98: "Судан",
    99: "Того",
    102: "Ливия",
    106: "Свазиленд",
    114: "Мавритания",
    115: "Сьерра-Леоне",
    119: "Бурунди",
    120: "Бенин",
    123: "Ботсвана",
    125: "ЦАР",
    130: "Гвинея-Бисау",
    133: "Коморы",
    135: "Либерия",
    136: "Лесото",
    137: "Малави",
    138: "Намибия",
    139: "Нигер",
    140: "Руанда",
    147: "Замбия",
    149: "Сомали",
    150: "Конго",
    152: "Буркина-Фасо",
    154: "Габон",
    167: "Экваториальная Гвинея",
    168: "Джибути",
    176: "Эритрея",
    177: "Южный Судан",
    178: "Сан-Томе и Принсипи",
    184: "Республика Сейшелы",
    186: "Кабо-Верде",
    192: "Западная Сахара",

    # Океания и прочие территории
    67: "Новая Зеландия",
    79: "Папуа-Новая Гвинея",
    91: "Тимор-Лесте",
    146: "Реюньон",
    157: "Маврикий",
    185: "Новая Каледония",
    189: "Фиджи",
    193: "Соломоновы острова",
    194: "Джерси",
    195: "Бермуды",
    197: "Тонга",
    198: "Самоа",
    201: "Гибралтар",
    202: "Фарерские острова"
}


list_for_sorting_countries_for_telegram = [
    "Турция",
    "Португалия",
    "США",
    "США (виртуальные)",
    "Греция",
    "Молдова",
    "Латвия",
    "Бельгия",
    "Венгрия",
    "Испания",
    "Франция",
    "Эстония",
    "Гайана",
    "Румыния",
    "Канада",
    "Мальта",
    "Литва",
    "Ангилья",
    "Сингапур",
    "Дания",
    "Германия",
    "Узбекистан",
    "Кипр",
    "Польша",
    "Австралия",
    "Аргентина",
    "Колумбия",
    "Швеция",
    "Украина",
    "Чили",
    "Хорватия",
    "Великобритания",
    "Таиланд",
    "Нидерланды",
    "Чехия",
    "Сальвадор",
    "Болгария",
    "Новая Зеландия",
    "Япония",
    "Бразилия",
    "Кыргызстан",
    "Пуэрто-Рико",
    "Ботсвана",
    "Ямайка",
    "Австрия",
    "Туркменистан",
    "Багамы",
    "Непал",
    "Марокко",
    "Италия",
    "Ирландия",
    "Индия",
    "Белиз",
    "Гонконг",
    "Алжир",
    "Мексика",
    "Гондурас",
    "Бутан",
    "ЦАР",
    "Доминиканская Республика",
    "Нигер",
    "Камерун",
    "Индонезия",
    "Конго",
    "Кот d'Ивуар",
    "Дем.Конго",
    "Финляндия",
    "Мальдивы",
    "Эфиопия",
    "Того",
    "Босния и Герцеговина",
    "Монако",
    "Маврикий",
    "Сьерра-Леоне",
    "Афганистан",
    "Уганда",
    "Ангола",
    "Тунис",
    "Зимбабве",
    "Мавритания",
    "Либерия",
    "Буркина-Фасо",
    "Шри-Ланка",
    "Катар",
    "Замбия",
    "Южный Судан",
    "Словения",
    "Китай",
    "Филиппины",
    "Мьянма",
    "Малайзия",
    "Кения",
    "Вьетнам",
    "Израиль",
    "Нигерия",
    "Египет",
    "Камбоджа",
    "Гаити",
    "Гамбия",
    "Сербия",
    "Йемен",
    "Чад",
    "Ирак",
    "Тайвань",
    "Сенегал",
    "Перу",
    "Гвинея",
    "Мали",
    "Монголия",
    "Папуа-Новая Гвинея",
    "Мозамбик",
    "Парагвай",
    "Никарагуа",
    "Боливия",
    "Гватемала",
    "Эквадор",
    "Бенин",
    "Таджикистан",
    "Реюньон",
    "Армения",
    "Ливан",
    "Габон",
    "Аруба",
    "Грузия",
    "Танзания",
    "Иордания",
    "Кувейт",
    "Свазиленд",
    "Оман",
    "Панама",
    "Барбадос",
    "Бурунди",
    "Гренада",
    "Гвинея-Бисау",
    "Коморы",
    "Лесото",
    "Малави",
    "Намибия",
    "Руанда",
    "Сомали",
    "Уругвай",
    "Французская Гвиана",
    "Экваториальная Гвинея",
    "Мадагаскар",
    "Острова Кайман",
    "Швейцария",
    "Эритрея",
    "Сан-Томе и Принсипи",
    "Монтсеррат",
    "Северная Македония",
    "Республика Сейшелы",
    "Новая Каледония",
    "Кабо-Верде",
    "Фиджи",
    "Азербайджан",
    "Судан",
    "Палестина",
    "Гибралтар",
]

list_for_sorting_countries_for_amazon = [
    "Япония",
    "Катар",
    "Колумбия",
    "Болгария",
    "Чехия",
    "Польша",
    "Бразилия",
    "Чили",
    "Хорватия",
    "Гондурас",
    "Португалия",
    "США (виртуальные)",
    "Аргентина",
    "Германия",
    "Турция",
    "Босния и Герцеговина",
    "Камерун",
    "Швеция",
    "Испания",
    "Финляндия",
    "Нидерланды",
    "Австралия",
    "Доминиканская Республика",
    "Индия",
    "Франция",
    "Молдова",
    "Румыния",
    "Австрия",
    "Дания",
    "Ирландия",
    "Канада",
    "Литва",
    "Индонезия",
    "Новая Зеландия",
    "Италия",
    "Таиланд",
    "ОАЭ",
    "Сербия",
    "Сингапур",
    "Марокко",
    "Украина",
    "Южная Африка",
    "Великобритания",
    "Венгрия",
    "Латвия",
    "Грузия",
    "Казахстан",
    "Греция",
    "Израиль",
    "США",
    "Малайзия",
    "Гонконг",
    "Лаос",
    "Египет",
    "Филиппины",
    "Сан-Томе и Принсипи",
    "Зимбабве",
    "Косово",
    "Аруба",
    "Коморы",
    "Белиз",
    "Барбадос",
    "Гайана",
    "Уругвай",
    "Новая Каледония",
    "Кабо-Верде",
    "Непал",
    "Мадагаскар",
    "Гватемала",
    "Мозамбик",
    "Иордания",
    "Экваториальная Гвинея",
    "Суринам",
    "Мальдивы",
    "Руанда",
    "Сальвадор",
    "Эквадор",
    "Тунис",
    "Мексика",
    "Дем.Конго",
    "Нигерия",
    "Гвинея",
    "Куба",
    "Армения",
    "Ангола",
    "Габон",
    "Кыргызстан",
    "Панама",
    "Танзания",
    "Ливан",
    "Словакия",
    "Боливия",
    "Сьерра-Леоне",
    "Гаити",
    "Люксембург",
    "Норвегия",
    "Швейцария",
    "Мавритания",
    "Никарагуа",
    "Вьетнам",
    "Монако",
    "Бурунди",
    "Сенегал",
    "Буркина-Фасо",
    "Перу",
    "Либерия",
    "Чад",
    "Гамбия",
    "Гвинея-Бисау",
    "Иран",
    "Бангладеш",
    "Северная Македония",
    "Гибралтар",
    "Азербайджан",
    "Узбекистан",
    "Таджикистан",
    "Афганистан",
    "Маврикий",
    "Мьянма",
    "Шри-Ланка",
    "Коста Рика",
    "Сауд. Аравия",
    "Монтсеррат",
    "Монголия",
    "Острова Кайман",
    "Сент-Люсия",
    "Джибути",
    "Республика Сейшелы",
    "Черногория",
    "Лесото",
    "Эритрея",
    "Исландия",
    "Макао",
    "Нигер",
    "Йемен",
    "Конго",
    "Оман",
    "Реюньон",
    "Туркменистан",
    "Ливия",
    "Ямайка",
    "Тимор-Лесте",
    "Свазиленд",
    "ЦАР",
    "Албания",
    "Бруней",
    "Гренада",
    "Багамы",
    "Французская Гвиана",
    "Гваделупа",
    "Бахрейн",
    "Сомали",
    "Кувейт",
    "Южный Судан",
    "Китай",
    "Пакистан",
    "Тайвань",
    "Ирак",
    "Намибия",
    "Тринидад и Тобаго",
    "Папуа-Новая Гвинея",
    "Сент-Китс и Невис",
    "Фиджи",
    "Доминика",
    "Ангилья",
    "Бутан",
    "Сент-Винсент и Гренадин",
    "Антигуа и Барбуда",
]

list_for_sorting_countries_for_claude = [
    "Нидерланды",
    "Франция",
    "Польша",
    "Дания",
    "Япония",
    "Украина",
    "Малайзия",
    "Великобритания",
    "Эстония",
    "Германия",
    "США",
    "Гибралтар",
    "Косово",
]

list_for_sorting_countries_for_google = [
    "Австрия",
    "Польша",
    "Колумбия",
    "Португалия",
    "Индонезия",
    "Австралия",
    "Чили",
    "Нидерланды",
    "США (виртуальные)",
    "Германия",
    "Норвегия",
    "Италия",
    "Испания",
    "Япония",
    "Бразилия",
    "Венгрия",
    "Дания",
    "Аргентина",
    "Чехия",
    "Гонконг",
    "Швеция",
    "Эстония",
    "Франция",
    "Великобритания",
    "Северная Македония",
    "Турция",
    "Таиланд",
    "Литва",
    "Ангола",
    "Латвия",
    "Бахрейн",
    "Кения",
    "Финляндия",
    "Израиль",
    "Новая Зеландия",
    "Мальта",
    "Ботсвана",
    "Уругвай",
    "США",
    "Руанда",
    "Украина",
    "Молдова",
    "Гвинея",
    "Сингапур",
    "Сауд. Аравия",
    "Кот д'Ивуар",
    "Сьерра-Леоне",
    "Канада",
    "Конго",
    "ОАЭ",
    "Иран",
    "Албания",
    "Гренада",
    "Нигер",
    "Кипр",
    "Грузия",
    "Парагвай",
    "Болгария",
    "Швейцария",
    "Румыния",
    "Куба",
    "Вьетнам",
    "Камерун",
    "Гондурас",
    "Ирак",
    "Коста Рика",
    "Ирландия",
    "Словения",
    "Черногория",
    "Словакия",
    "Никарагуа",
    "Маврикий",
    "Филиппины",
    "Хорватия",
    "Панама",
    "Греция",
    "Пуэрто-Рико",
    "Малайзия",
    "Индия",
    "Египет",
    "Китай",
    "Сальвадор",
    "Либерия",
    "Бутан",
    "Беларусь",
    "Южная Африка",
    "Ямайка",
    "Мавритания",
    "Гамбия",
    "Казахстан",
    "Бангладеш",
    "Бельгия",
    "Монголия",
    "Габон",
    "Мексика",
    "Макао",
    "Пакистан",
    "Лаос",
    "Сербия",
    "Венесуэла",
    "Гана",
    "Эквадор",
    "Дем.Конго",
    "Нигерия",
    "Армения",
    "Перу",
    "Непал",
    "Камбоджа",
    "Алжир",
    "Кыргызстан",
    "Танзания",
    "Мьянма",
    "Мадагаскар",
    "Эфиопия",
    "Того",
    "Бенин",
    "Судан",
    "Мали",
    "Замбия",
    "Малави",
    "Марокко",
    "Тунис",
    "Ливан",
    "Боливия",
    "Гаити",
    "Люксембург",
    "Монако",
    "Бурунди",
    "Сенегал",
    "Буркина-Фасо",
    "Чад",
    "Гвинея-Бисау",
    "Гибралтар",
    "Азербайджан",
    "Узбекистан",
    "Таджикистан",
    "Афганистан",
    "Ангилья",
    "Шри-Ланка",
    "Доминика",
    "Монтсеррат",
    "Новая Каледония",
    "Кабо-Верде",
    "Гватемала",
    "Мозамбик",
    "Иордания",
    "Тайвань",
    "Экваториальная Гвинея",
    "Суринам",
    "Мальдивы",
    "Острова Кайман",
    "Сент-Люсия",
    "Джибути",
    "Республика Сейшелы",
    "Сан-Томе и Принсипи",
    "Лесото",
    "Гайана",
    "Барбадос",
    "Намибия",
    "Белиз",
    "Коморы",
    "Аруба",
    "Зимбабве",
    "Эритрея",
    "Исландия",
    "Тринидад и Тобаго",
    "Йемен",
    "Оман",
    "Реюньон",
    "Катар",
    "Папуа-Новая Гвинея",
    "Туркменистан",
    "Ливия",
    "Тимор-Лесте",
    "Палестина",
    "Фиджи",
    "Свазиленд",
    "ЦАР",
    "Сент-Китс и Невис",
    "Сент-Винсент и Гренадин",
    "Бруней",
    "Багамы",
    "Французская Гвиана",
    "Антигуа и Барбуда",
    "Гваделупа",
    "Сомали",
    "Кувейт",
    "Южный Судан",
    "Косово",
]

list_for_sorting_countries_for_tiktok = [
    "Норвегия",
    "Канада",
    "США",
    "Туркменистан",
    "Макао",
    "США (виртуальные)",
    "Монголия",
    "Уганда",
    "Япония",
    "Словакия",
    "Южная Африка",
    "Эстония",
    "Сингапур",
    "Дания",
    "Греция",
    "Австралия",
    "Дем.Конго",
    "Бразилия",
    "Новая Зеландия",
    "Турция",
    "Гонконг",
    "Нидерланды",
    "Португалия",
    "Украина",
    "Испания",
    "Таиланд",
    "Филиппины",
    "Колумбия",
    "Франция",
    "Германия",
    "Венесуэла",
    "Швеция",
    "Армения",
    "Индонезия",
    "Грузия",
    "Индия",
    "Болгария",
    "Марокко",
    "Хорватия",
    "Молдова",
    "Йемен",
    "ОАЭ",
    "Ирландия",
    "Великобритания",
    "Доминиканская Республика",
    "Литва",
    "Кипр",
    "Латвия",
    "Польша",
    "Румыния",
    "Мьянма",
    "Словения",
    "Казахстан",
    "Израиль",
    "Беларусь",
    "Финляндия",
    "Таджикистан",
    "Малайзия",
    "Кыргызстан",
    "Ангола",
    "Узбекистан",
    "Вьетнам",
    "Чили",
    "Чехия",
    "Камбоджа",
    "Египет",
    "Аргентина",
    "Италия",
    "Пуэрто-Рико",
    "Руанда",
    "Иран",
    "Антигуа и Барбуда",
    "Лесото",
    "Белиз",
    "Кот д'Ивуар",
    "Камерун",
    "Замбия",
    "Парагвай",
    "Кения",
    "Гана",
    "Малави",
    "Сальвадор",
    "Эквадор",
    "Тунис",
    "Гондурас",
    "Мексика",
    "Нигерия",
    "Гвинея",
    "Куба",
    "Босния и Герцеговина",
    "Габон",
    "Панама",
    "Танзания",
    "Ливан",
    "Боливия",
    "Сьерра-Леоне",
    "Гаити",
    "Люксембург",
    "Швейцария",
    "Мавритания",
    "Никарагуа",
    "Монако",
    "Бурунди",
    "Сенегал",
    "Буркина-Фасо",
    "Перу",
    "Либерия",
    "Чад",
    "Гамбия",
    "Гвинея-Бисау",
    "Бангладеш",
    "Северная Македония",
    "Гибралтар",
    "Афганистан",
    "Маврикий",
    "Шри-Ланка",
    "Пакистан",
    "Коста Рика",
    "Сауд. Аравия",
    "Доминика",
    "Монтсеррат",
    "Новая Каледония",
    "Кабо-Верде",
    "Непал",
    "Мадагаскар",
    "Гватемала",
    "Мозамбик",
    "Иордания",
    "Мальдивы",
    "Уругвай",
    "Острова Кайман",
    "Сент-Люсия",
    "Джибути",
    "Республика Сейшелы",
    "Сан-Томе и Принсипи",
    "Черногория",
    "Гайана",
    "Барбадос",
    "Намибия",
    "Аруба",
    "Зимбабве",
    "Эритрея",
    "Исландия",
    "Нигер",
    "Конго",
    "Оман",
    "Катар",
    "Ямайка",
    "Албания",
    "Бруней",
    "Гренада",
    "Багамы",
    "Французская Гвиана",
    "Гваделупа",
    "Бахрейн",
    "Сомали",
    "Кувейт",
    "Южный Судан",
    "Азербайджан",
    "Сент-Китс и Невис",
    "Тринидад и Тобаго",
    "ЦАР",
    "Тайвань",
    "Тимор-Лесте",
    "Реюньон",
    "Свазиленд",
    "Бутан",
    "Папуа-Новая Гвинея",
    "Ливия",
    "Ангилья",
    "Сент-Винсент и Гренадин",
    "Косово",
]

list_for_sorting_countries_for_vkcom = [
    "Казахстан",
    "США",
    "Канада",
    "Турция",
    "Таиланд",
    "Австралия",
    "Армения",
    "Австрия",
    "Эстония",
    "Испания",
    "Сербия",
    "Ирландия",
    "Италия",
    "Гонконг",
    "Польша",
    "Украина",
    "Чехия",
    "Бразилия",
    "Кипр",
    "Новая Зеландия",
    "Германия",
    "Латвия",
    "Венгрия",
    "Болгария",
    "Литва",
    "Япония",
    "Португалия",
    "Сирия",
    "Финляндия",
    "Молдова",
    "Мексика",
    "Кыргызстан",
    "Беларусь",
    "Дем.Конго",
    "Франция",
    "Узбекистан",
    "Грузия",
    "Греция",
    "Норвегия",
    "Ангола",
    "Сингапур",
    "Нигер",
    "Доминика",
    "Монако",
    "Таджикистан",
    "Мавритания",
    "Суринам",
    "Словакия",
    "Бруней",
    "Багамы",
    "Ботсвана",
    "Белиз",
    "ЦАР",
    "Гренада",
    "Гвинея-Бисау",
    "Гайана",
    "Исландия",
    "Коморы",
    "Сент-Китс и Невис",
    "Либерия",
    "Лесото",
    "Малави",
    "Намибия",
    "Руанда",
    "Южный Судан",
    "Швейцария",
    "Эритрея",
    "Нидерланды",
    "Сауд. Аравия",
    "Тайвань",
    "Иран",
    "Алжир",
    "Словения",
    "Бангладеш",
    "Сенегал",
    "Шри-Ланка",
    "Перу",
    "Пакистан",
    "Гвинея",
    "Мали",
    "Венесуэла",
    "Эфиопия",
    "Монголия",
    "Афганистан",
    "Уганда",
    "Папуа-Новая Гвинея",
    "Мозамбик",
    "Непал",
    "Бельгия",
    "Парагвай",
    "Гондурас",
    "Тунис",
    "Никарагуа",
    "Тимор-Лесте",
    "Боливия",
    "Коста Рика",
    "Гватемала",
    "ОАЭ",
    "Зимбабве",
    "Пуэрто-Рико",
    "Судан",
    "Того",
    "Кувейт",
    "Сальвадор",
    "Ливия",
    "Ямайка",
    "Тринидад и Тобаго",
    "Эквадор",
    "Свазиленд",
    "Оман",
    "Босния и Герцеговина",
    "Доминиканская Республика",
    "Катар",
    "Панама",
    "Куба",
    "Сьерра-Леоне",
    "Иордания",
    "Барбадос",
    "Бурунди",
    "Бенин",
    "Бахрейн",
    "Реюньон",
    "Замбия",
    "Сомали",
    "Конго",
    "Чили",
    "Буркина-Фасо",
    "Ливан",
    "Габон",
    "Албания",
    "Уругвай",
    "Маврикий",
    "Бутан",
    "Мальдивы",
    "Гваделупа",
    "Французская Гвиана",
    "Сент-Люсия",
    "Люксембург",
    "Сент-Винсент и Гренадин",
    "Экваториальная Гвинея",
    "Джибути",
    "Антигуа и Барбуда",
    "Острова Кайман",
    "Черногория",
    "Дания",
    "Сан-Томе и Принсипи",
    "Аруба",
    "Монтсеррат",
    "Ангилья",
    "Северная Македония",
    "Республика Сейшелы",
    "Новая Каледония",
    "Кабо-Верде",
    "Фиджи",
    "Мальта",
    "Гибралтар",
    "Косово",
]

list_for_sorting_countries_for_paypal = [
    "Испания",
    "Норвегия",
    "Туркменистан",
    "Тайвань",
    "Австралия",
    "Дания",
    "Бразилия",
    "Чехия",
    "Мексика",
    "Ямайка",
    "Нидерланды",
    "Кипр",
    "Таиланд",
    "Португалия",
    "Словакия",
    "Польша",
    "Финляндия",
    "Ирландия",
    "Великобритания",
    "Литва",
    "Аргентина",
    "Германия",
    "Гонконг",
    "Албания",
    "Франция",
    "США",
    "Латвия",
    "Эстония",
    "Швейцария",
    "Италия",
    "Австрия",
    "Греция",
    "Индия",
    "Монголия",
    "Румыния",
    "Сингапур",
    "Чили",
    "Хорватия",
    "Израиль",
    "Бельгия",
    "Канада",
    "Египет",
    "Болгария",
    "Китай",
    "Япония",
    "Молдова",
    "Украина",
    "Словения",
    "Марокко",
    "Швеция",
    "Перу",
    "Грузия",
    "Индонезия",
    "Филиппины",
    "Ангола",
    "Армения",
    "Малайзия",
    "Колумбия",
    "Мадагаскар",
    "Эритрея",
    "Камбоджа",
    "Нигер",
    "Йемен",
    "Ливия",
    "Папуа-Новая Гвинея",
    "Катар",
    "Иордания",
    "Парагвай",
    "Кения",
    "Малави",
    "Уганда",
    "Сальвадор",
    "Эквадор",
    "Тунис",
    "Гондурас",
    "Дем.Конго",
    "Нигерия",
    "Гвинея",
    "Босния и Герцеговина",
    "Венгрия",
    "Габон",
    "Кыргызстан",
    "Панама",
    "Танзания",
    "Ливан",
    "Новая Зеландия",
    "Боливия",
    "Сьерра-Леоне",
    "Гаити",
    "Мавритания",
    "Никарагуа",
    "Вьетнам",
    "Монако",
    "Бурунди",
    "Сенегал",
    "Буркина-Фасо",
    "Либерия",
    "Чад",
    "Гамбия",
    "Доминиканская Республика",
    "Гвинея-Бисау",
    "Афганистан",
    "Маврикий",
    "Непал",
    "Мьянма",
    "Шри-Ланка",
    "Кабо-Верде",
    "Реюньон",
    "Мозамбик",
    "Экваториальная Гвинея",
    "Сербия",
    "Мальдивы",
    "Уругвай",
    "Республика Сейшелы",
    "Ботсвана",
    "Сан-Томе и Принсипи",
    "Ирак",
    "Руанда",
    "Лесото",
    "Пуэрто-Рико",
    "Гайана",
    "Намибия",
    "Коморы",
    "Аруба",
    "Зимбабве",
    "Конго",
    "Оман",
    "Южный Судан",
    "Белиз",
    "Багамы",
    "Мальта",
    "Монтсеррат",
    "Новая Каледония",
    "Острова Кайман",
    "Ангилья",
    "Французская Гвиана",
    "Антигуа и Барбуда",
    "Косово",
]

list_for_sorting_countries_for_any_other = [
    "Аргентина",
    "Сингапур",
    "Бразилия",
    "Португалия",
    "Германия",
    "Румыния",
    "Австралия",
    "Дания",
    "Нидерланды",
    "Великобритания",
    "Испания",
    "Малайзия",
    "Колумбия",
    "Украина",
    "Камбоджа",
    "Гонконг",
    "Марокко",
    "США",
    "Швеция",
    "Чехия",
    "Польша",
    "Вьетнам",
    "Франция",
    "Филиппины",
    "Эстония",
    "Ирландия",
    "Кыргызстан",
    "Болгария",
    "Индонезия",
    "Кения",
    "Чили",
    "Казахстан",
    "Словения",
    "Лаос",
    "Австрия",
    "Таджикистан",
    "Афганистан",
    "Алжир",
]


# Приоритетная сортировка стран по сервисам
COUNTRY_PRIORITY_LIST_BY_SERVICE: dict[str, list[str]] = {
    # основные коды (как в SMSFAST_SERVICE_MAP)
    "telegram": list_for_sorting_countries_for_telegram,
    "amazon": list_for_sorting_countries_for_amazon,
    "claude": list_for_sorting_countries_for_claude,
    "google": list_for_sorting_countries_for_google,
    "tiktok": list_for_sorting_countries_for_tiktok,
    "vkcom": list_for_sorting_countries_for_vkcom,
    "paypal": list_for_sorting_countries_for_paypal,
    "ot": list_for_sorting_countries_for_any_other,

}




